


IETF                                                          M. Slusarz
Internet-Draft                                                 Horde LLC
Intended status: Standards Track                       November 17, 2012
Expires: May 21, 2013


                         IMAP SUSPEND Extension
                         draft-imap-suspend-00

Abstract

   This document defines the SUSPEND extension for the IMAP protocol.
   It provides a method for a client to save the current configuration
   state of an IMAP session and then quickly restore this configuration
   in a subsequent session.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on May 21, 2013.

Copyright Notice

   Copyright (c) 2012 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.




Slusarz                   Expires May 21, 2013                  [Page 1]

Internet-Draft           IMAP SUSPEND Extension            November 2012


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3
     1.1.  Requirements Language . . . . . . . . . . . . . . . . . . . 4
   2.  IMAP Protocol Changes . . . . . . . . . . . . . . . . . . . . . 4
     2.1.  SUSPEND Command . . . . . . . . . . . . . . . . . . . . . . 4
     2.2.  RESUME Command  . . . . . . . . . . . . . . . . . . . . . . 4
     2.3.  SUSPEND Response  . . . . . . . . . . . . . . . . . . . . . 5
     2.4.  RESUME Response Code  . . . . . . . . . . . . . . . . . . . 6
   3.  Implementation Considerations . . . . . . . . . . . . . . . . . 6
     3.1.  Client  . . . . . . . . . . . . . . . . . . . . . . . . . . 6
     3.2.  Server  . . . . . . . . . . . . . . . . . . . . . . . . . . 6
   4.  Examples  . . . . . . . . . . . . . . . . . . . . . . . . . . . 7
   5.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . . . 8
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 8
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 8
   8.  Security Considerations . . . . . . . . . . . . . . . . . . . . 8
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 9
     9.1.  Normative References  . . . . . . . . . . . . . . . . . . . 9
     9.2.  Informative References  . . . . . . . . . . . . . . . . . . 9
   Author's Address  . . . . . . . . . . . . . . . . . . . . . . . . . 9






























Slusarz                   Expires May 21, 2013                  [Page 2]

Internet-Draft           IMAP SUSPEND Extension            November 2012


1.  Introduction

   [TODO: Reorganize this section.  Disconnected talk should probably go
   lower in section, after talk about activating extensions.]

   The original IMAP4rev1 [RFC3501] protocol specification was primarily
   designed to be used by clients that remain connected to the IMAP
   server for extended periods of time.  Since that time, "disconnected"
   IMAP clients [RFC4549] have become increasingly popular and numerous,
   due to the rise in, for example, portable devices that do not
   maintain persistent connections to the remove server, or for which
   keeping an active connection is expensive (in terms of computing
   and/or power).

   In response to the rise of these disconnected clients, various IMAP
   extensions have been developed to assist in accessing the remote
   account.  [TODO: Links to LEMONADE profile?  UIDPLUS?]  Some of these
   extensions, such as QRESYNC [RFC5162], require explicit action by the
   client in order to activate their features.

   Other advanced IMAP features, such as the LANGUAGE command [RFC5255],
   also require explicit configuration by the client and is forgotten
   when the client logs out of the server [TODO: mention NOTIFY?].

   Finally, there is additional overhead when connecting to an IMAP
   server (e.g. entering authenticated state) because the client needs
   to do things like determine the capabilities of the remote server
   (CAPABILITY command [RFC3501]) and, if available, to obtain the
   namespace layout for the mailboxes (NAMESPACE command [RFC2342]).

   Therefore, a disconnected client still faces the (potentially
   substantial) overhead of needing to perform various initialization
   initialization tasks before the client can begin to do "useful" work
   from the perspective of the end user (e.g. listing mailboxes
   accessing messages).  For clients that are unable to maintain a
   persistent connection the server, many of the gains provided by the
   advanced IMAP extensions are offset by the overhead to enable and
   confgure them on every access.

   The SUSPEND extension provides a mechanism for a client to save the
   configuration state of an existing session and then quickly re-
   establish this configuration in subsequent server connections.

   An IMAP server that supports SUSPEND advertises this by including the
   word SUSPEND in its capability list.






Slusarz                   Expires May 21, 2013                  [Page 3]

Internet-Draft           IMAP SUSPEND Extension            November 2012


1.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

   In examples, lines beginning with "S:" are sent by the IMAP server,
   and lines beginning with "C:" are sent by the client.  Line breaks
   may appear in example commands solely for editorial clarity; when
   present in the actual message, they are represented by "CRLF".


2.  IMAP Protocol Changes

2.1.  SUSPEND Command

   Arguments:  none

   Responses:  REQUIRED untagged response: BYE
               OPTIONAL untagged response: SUSPEND

   Result:     OK - logout completed
               BAD - command unknown or arguments invalid

   This section defines a new SUSPEND command.

   To close the connection with the server, the LOGOUT command [RFC3501]
   is issued.  The SUSPEND command extends the LOGOUT command by
   indicating to the server that, in addition to closing the network
   connection, the client also requests that the current configuration
   state be saved.

   If the current IMAP configuration state can be saved, an untagged
   SUSPEND response (see Section 2.3) MUST be issued.  If the server
   cannot save the current state, a SUSPEND response MUST NOT be issued.

   Like the LOGOUT command, a server MUST send a BYE untagged response
   before the (tagged) OK response, and then close the network
   connection.

2.2.  RESUME Command

   Arguments:  suspend token

   Responses:  no specific response for this command






Slusarz                   Expires May 21, 2013                  [Page 4]

Internet-Draft           IMAP SUSPEND Extension            November 2012


   Result:     OK - suspend token is valid
               NO - suspend token is invalid
               BAD - command unknown or arguments invalid

   This section defines a new RESUME command.

   This command is used when a client desires to restore the
   configuration state represented by a token previously generated by
   the server.

   The RESUME command MUST only be issued in either the not
   authenticated state or in the authenticated state.  If the RESUME
   command is issued in the selected state, a BAD tagged response MUST
   be sent.

   If the command is sent in the not authenticated state, the client is
   indicating that it desires the restore the configuration state
   represented by the token after authentication is completed.  If the
   command is issued in the authenticated state, the client is
   requesting that the current IMAP configuration be immediately
   switched to the configuration state indicated by the token.

   If issued in the not authenticated state, the RESUME command SHOULD
   NOT be issued until the TLS [RFC5246] layer has been negotiated.

   If the token is invalid or has expired, the RESUME command MUST
   return a tagged NO response.

   If the token is valid, the RESUME command MUST return a tagged OK
   response.  This does NOT mean that the configuration state has been
   restored; that only occurs after the server issues a RESUME response
   code (see Section 2.4).

   If the server can successfully restore the state indicated by the
   given token, it MUST issue an tagged OK response.  This restored
   session MUST be identical to the state at the time the SUSPEND
   command that issued the token was issued.  After a successful RESUME
   command, the connection MUST be in the authenticated state (i.e. no
   mailbox is selected).

2.3.  SUSPEND Response

   Contents:   suspend token

   The SUSPEND response occurs as a result of a SUSPEND command.  The
   suspend token is a server-specific representation of the current
   configuration state of the IMAP session.




Slusarz                   Expires May 21, 2013                  [Page 5]

Internet-Draft           IMAP SUSPEND Extension            November 2012


   [todo: A suspend token MUST become invalid if either the NAMESPACE or
   CAPABILITY configuration of the server changes.]

   It is RECOMMENDED that the suspend token contain a versioning
   mechanism that would cause the token to be unsuccessful in restoring
   state if the internal state storage mechanism in the server changes.
   However, interpretation of the contents or format of the suspend
   token is left entirely to the server implementor.

2.4.  RESUME Response Code

   This section defines a new RESUME response code:

      OK [RESUME <suspend-token>]

      where <suspend-token> is the token identifier associated with the
      configuration state that was restored.

   If a client issued a successful RESUME command in the not
   authenticated state, this response code MUST be issued in response to
   the authentication command.

   If a client issued a successful RESUME command in the authenticated
   state, this response code MUST be issued in the response to the
   RESUME command.


3.  Implementation Considerations

3.1.  Client

   [todo: Successfully resuming a session guarantees that the NAMESPACE
   and CAPABILITY values of the server have not changed.  A client is
   RECOMMENDED to cache these values locally.  Not sure if this is even
   needed, since it is a/the main reason to use this extension.]

3.2.  Server

   If a session is successfully resumed via a RESUME command issued
   before authentication, the client is assumed to be using a cached
   version of the CAPABILITY list.  Therefore, a server SHOULD NOT
   automatically issue a CAPABILITY response code as a result of the
   authentication command since the client will already have this
   information.







Slusarz                   Expires May 21, 2013                  [Page 6]

Internet-Draft           IMAP SUSPEND Extension            November 2012


4.  Examples

   Example 1: A client connects to a server and does not have a saved
   suspend token.  The client verifies that the server supports the the
   SUSPEND extension, performs its initialization, and obtains a suspend
   token.

      <Client successfully authenticates to server>
      C: A1 CAPABILITY
      S: * CAPABILITY IMAP4rev1 ENABLE QRESYNC I18NLEVEL=1 SUSPEND
      S: A1 OK Capability command completed.
      C: A2 ENABLE QRESYNC
      S: * ENABLED QRESYNC
      S: A2 OK Enable command completed.
      C: A3 LANGUAGE DE
      S: * LANGUAGE (DE)
      S: * NAMESPACE (("" "/")) (("Other Users/" "/"
           "TRANSLATION" ("Andere Ben&APw-tzer/")))
           (("Public Folders/" "/" "TRANSLATION"
           ("Gemeinsame Postf&AM8-cher/")))
      S: A3 Sprachwechsel durch LANGUAGE-Befehl ausgefuehrt
      [...]
      C: A20 SUSPEND
      S: * SUSPEND c3RhdGUgdG9rZW4=
      S: * BYE Server logging out.
      S: A20 OK Logout completed.

   Example 2: The client in Example 1 connects at a future time to the
   same server and seeks to restore the previous IMAP session.

      C: * OK [CAPABILITY IMAP4rev1 STARTTLS LOGINDISABLED SUSPEND]
      C: A1 STARTTLS
      S: A1 OK Being TLS negotiation now.
      <TLS negotiation, further commands are under TLS [RFC5246] layer>
      C: A2 CAPABILITY
      S: * CAPABILITY IMAP4rev1 AUTH=PLAIN SUSPEND
      S: A2 OK CAPABILITY completed.
      C: A3 RESUME c3RhdGUgdG9rZW4=
      S: A3 OK Suspend token valid.
      C: A4 LOGIN joe passwd
      S: A4 OK [RESUME c3RhdGUgdG9rZW4=] LOGIN completed and
            configuration restored.

   Example 3: The client in Example 1 connects at a future time to the
   same server and seeks to restore the previous IMAP session.  In this
   example, the connection was pre-authenticated so the RESUME command
   is issued in the authenticated state.




Slusarz                   Expires May 21, 2013                  [Page 7]

Internet-Draft           IMAP SUSPEND Extension            November 2012


      S: * PREAUTH [CAPABILITY IMAP4rev1 ENABLE QRESYNC I18NLEVEL=1
           SUSPEND]
      C: A1 RESUME c3RhdGUgdG9rZW4=
      S: A1 OK [RESUME c3RhdGUgdG9rZW4=] Configuration restored.


5.  Formal Syntax

   The following syntax specification uses the Augmented Backus-Naur
   Form (ABNF) as described in [RFC5234].  Terms not defined here are
   taken from [RFC3501].



      capability =/  "SUSPEND"

      command-auth =/  resume / suspend

      response-data =/  "*" SP suspend-response CRLF

      resp-text-code =/  "RESUME" SP suspend-token

      resume =  "RESUME" SP suspend-token

      suspend =  "SUSPEND"

      suspend-response =  "SUSPEND" SP suspend-token

      suspend-token =  atom


6.  IANA Considerations

   The IANA is requested to add SUSPEND to the "IMAP 4 Capabilities"
   registry, http://www.iana.org/assignments/imap4-capabilities.


7.  Acknowledgements


8.  Security Considerations

   Depending on the server implementation of the suspend token, this
   item may provide details on IMAP commands issued by the client while
   authenticated.  To protect these details, Section 2.2 indicates that
   the suspend token SHOULD NOT be output to the server until the TLS
   negotiation is complete.




Slusarz                   Expires May 21, 2013                  [Page 8]

Internet-Draft           IMAP SUSPEND Extension            November 2012


   Otherwise, it is believed that this extension doesn't add any
   security considerations that are not already present in the base IMAP
   protocol [RFC3501].


9.  References

9.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3501]  Crispin, M., "INTERNET MESSAGE ACCESS PROTOCOL - VERSION
              4rev1", RFC 3501, March 2003.

   [RFC5234]  Crocker, D. and P. Overell, "Augmented BNF for Syntax
              Specifications: ABNF", STD 68, RFC 5234, January 2008.

9.2.  Informative References

   [RFC2342]  Gahrns, M. and C. Newman, "IMAP4 Namespace", RFC 2342,
              May 1998.

   [RFC4549]  Melnikov, A., "Synchronization Operations for Disconnected
              IMAP4 Clients", RFC 4549, June 2006.

   [RFC5162]  Melnikov, A., Cridland, D., and C. Wilson, "IMAP4
              Extensions for Quick Mailbox Resynchronization", RFC 5162,
              March 2008.

   [RFC5246]  Dierks, T. and E. Rescorla, "The Transport Layer Security
              (TLS) Protocol Version 1.2", RFC 5246, August 2008.

   [RFC5255]  Newman, C., Gulbrandsen, A., and A. Melnikov, "Internet
              Message Access Protocol Internationalization", RFC 5255,
              June 2008.


Author's Address

   Michael M. Slusarz
   Horde LLC
   Denver, Colorado
   USA

   Email: slusarz@horde.org





Slusarz                   Expires May 21, 2013                  [Page 9]

